La-guajolota/STM32_proyects/reflow_oven/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define built_in_led_Pin GPIO_PIN_13
#define built_in_led_GPIO_Port GPIOC
#define encoder_A_Pin GPIO_PIN_0
#define encoder_A_GPIO_Port GPIOA
#define encoder_B_Pin GPIO_PIN_1
#define encoder_B_GPIO_Port GPIOA
#define encoder_pulse_Pin GPIO_PIN_2
#define encoder_pulse_GPIO_Port GPIOA
#define encoder_pulse_EXTI_IRQn EXTI2_IRQn
#define CS_0_Pin GPIO_PIN_7
#define CS_0_GPIO_Port GPIOA
#define CS_1_Pin GPIO_PIN_0
#define CS_1_GPIO_Port GPIOB
#define CS_2_Pin GPIO_PIN_1
#define CS_2_GPIO_Port GPIOB
#define CS_3_Pin GPIO_PIN_2
#define CS_3_GPIO_Port GPIOB
#define fire_Pin GPIO_PIN_8
#define fire_GPIO_Port GPIOA
#define zc_crossing_Pin GPIO_PIN_12
#define zc_crossing_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
